Public Member Functions | List of all members
API_IEventNotifier Class Referenceabstract
Notifications Manager
Defining an interface for a class that will be used to notify all event handlers. More...
#include <APIdefs_Callback.h>
 Public Member Functions
virtual  | ~API_IEventNotifier ()=default
virtual void  | NotifyAttributeChanges (const API_IAttributeEventHandler &eventHandler) const =0
virtual void  | NotifyAttributeFolderChanges (const API_IAttributeFolderEventHandler &eventHandler) const =0
virtual void  | NotifyClassificationItemChanges (const API_IClassificationItemEventHandler &eventHandler) const =0
virtual void  | NotifyClassificationSystemChanges (const API_IClassificationSystemEventHandler &eventHandler) const =0
virtual void  | NotifyPropertyGroupChanges (const API_IPropertyGroupEventHandler &eventHandler) const =0
virtual void  | NotifyPropertyDefinitionChanges (const API_IPropertyDefinitionEventHandler &eventHandler) const =0
virtual void  | NotifyGraphisoftIDChanges (const API_IGraphisoftIDEventHandler &eventHandler) const =0
virtual void  | NotifyEnableAllDialogInfoEvent (const API_IEnableAllInfoDialogEventHandler &eventHandler) const =0
virtual void  | NotifyMarqueeEvent (const API_IMarqueeEventHandler &eventHandler) const =0
Detailed Description
Defining an interface for a class that will be used to notify all event handlers.
Since
Archicad 26
Constructor & Destructor Documentation
◆ ~API_IEventNotifier()
 virtual API_IEventNotifier::~API_IEventNotifier  |  ( |   | )
virtualdefault
Member Function Documentation
◆ NotifyAttributeChanges()
 virtual void API_IEventNotifier::NotifyAttributeChanges  |  ( |  const API_IAttributeEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyAttributeFolderChanges()
 virtual void API_IEventNotifier::NotifyAttributeFolderChanges  |  ( |  const API_IAttributeFolderEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyClassificationItemChanges()
 virtual void API_IEventNotifier::NotifyClassificationItemChanges  |  ( |  const API_IClassificationItemEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyClassificationSystemChanges()
 virtual void API_IEventNotifier::NotifyClassificationSystemChanges  |  ( |  const API_IClassificationSystemEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyEnableAllDialogInfoEvent()
 virtual void API_IEventNotifier::NotifyEnableAllDialogInfoEvent  |  ( |  const API_IEnableAllInfoDialogEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyGraphisoftIDChanges()
 virtual void API_IEventNotifier::NotifyGraphisoftIDChanges  |  ( |  const API_IGraphisoftIDEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyMarqueeEvent()
 virtual void API_IEventNotifier::NotifyMarqueeEvent  |  ( |  const API_IMarqueeEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyPropertyDefinitionChanges()
 virtual void API_IEventNotifier::NotifyPropertyDefinitionChanges  |  ( |  const API_IPropertyDefinitionEventHandler &  |  eventHandler | ) |   const
pure virtual
◆ NotifyPropertyGroupChanges()
 virtual void API_IEventNotifier::NotifyPropertyGroupChanges  |  ( |  const API_IPropertyGroupEventHandler &  |  eventHandler | ) |   const
pure virtual